tutorials/squareCylinder/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-1 -1 -0.15)
    (2 -1 -0.15)
    (2  1 -0.15)
    (-1  1 -0.15)
    (-1 -1 0.15)
    (2 -1 0.15)
    (2  1 0.15)
    (-1  1 0.15)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (30 20 3) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    side1
    {
        type patch;
        faces
        (
            (1 5 4 0)
        );
    }
    side2
    {
        type patch;
        faces
        (
            (3 7 6 2) 
        );
    }
    lowerUpper1
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    lowerUpper2
    {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }
);

// ************************************************************************* //
